---
## Ejercicios:

1. Haz las importaciones necesarias para establecer la conxión y trabajar con Pandas.Establece la conexión usando mysql.connector utilizando try/except por si la conexión devuelve un error.

In [1]:
import mysql.connector
from mysql.connector import errorcode
import pandas as pd
import numpy as np

In [2]:
try:
  cnx = mysql.connector.connect(user='root', password='AlumnaAdalab', host='127.0.0.1')
except mysql.connector.Error as err:
  if err.errno == errorcode.ER_ACCESS_DENIED_ERROR:
    print("Something is wrong with your user name or password")
  elif err.errno == errorcode.ER_BAD_DB_ERROR:
    print("Database does not exist")
  else:
    print(err)
else:
  cnx.close()

2. Crea un nuevo "schema" llamado "alumnas-promo-X"

In [3]:
cnx = mysql.connector.connect(user='root', password='AlumnaAdalab', host='127.0.0.1')
my_cursor=cnx.cursor()
try:
    my_cursor.execute('CREATE SCHEMA alumnas_promo_h')
    print(my_cursor)
except mysql.connector.Error as err:
    print(err)
    print('Error code:', err.errno)
    print('SQLSTATE', err.sqlstate)
    print('Message', err.msg)

CMySQLCursor: CREATE SCHEMA alumnas_promo_h

3. Crea una tabla con la información de las alumnas de la promo. Debe incluir: id_alumna, nombre, apellidos, ciudad y teléfono.

In [4]:
cnx=mysql.connector.connect(user='root', password='AlumnaAdalab', host='127.0.0.1', database='alumnas_promo_h')
my_cursor=cnx.cursor()
try:
    my_cursor.execute('CREATE TABLE alumnas (id_alumna INTEGER AUTO_INCREMENT PRIMARY KEY, nombre VARCHAR (50), apellidos VARCHAR (75), ciudad VARCHAR (50), telefono VARCHAR (15))')
    print(my_cursor)
except mysql.connector.Error as err:
    print(err)
    print('Error code:', err.errno)
    print('SQLSTATE', err.sqlstate)
    print('Message', err.msg)

CMySQLCursor: CREATE TABLE alumnas (id_alumna INTEGER ..

4. Inserta por lo menos 10 datos en la tabla creada en el ejercicio anterior (pueden ser inventados).

In [5]:
cnx=mysql.connector.connect(user='root', password='AlumnaAdalab', host='127.0.0.1', database='alumnas_promo_h')
my_cursor=cnx.cursor()
sentencia='INSERT INTO alumnas (nombre, apellidos, ciudad, telefono) VALUES (%s, %s, %s, %s)'
values=[('María', 'Martínez López', 'Vigo', '666111222'),
        ('Lucía', 'Rodríguez Estévez', 'A Coruña', '666222333'),
        ('Carla', 'López Castelao', 'Pontevedra', '666333444'),
        ('Kasia', 'Torres Arriba', 'Vilaboa', '666444555'),
        ('Joyce', 'Tapias González', 'Camariñas', '666555666'),
        ('Kate', 'Winslet', 'Bath', '666666777'),
        ('Alice', 'Gould Almenara', 'Madrid', '666777888'),
        ('Lola', 'Bernárdez Balit', 'Corrubedo', '666888999'),
        ('Ivanira', 'Silva Montes', 'Vigo', '666999111'),
        ('Joanna', 'Blanchet Hataway', 'Lugo', '666123456')]
try:
    my_cursor.executemany(sentencia, values)
    cnx.commit()
    print(my_cursor.rowcount, 'registros insertados')
except mysql.connector.Error as err:
    print(err)
    print("Error Code:", err.errno)
    print("SQLSTATE", err.sqlstate)
    print("Message", err.msg)

10 registros insertados

5. Haz una consulta que devuelva todos los registros de la tabla "alumnas" y conviértelo en Dataframe (no te olvides del nombre de las columnas).

In [6]:
#insertando los encabezados manualmente
cnx=mysql.connector.connect(user='root', password='AlumnaAdalab', host='127.0.0.1', database='alumnas_promo_h')
my_cursor=cnx.cursor()
my_cursor.execute('SELECT * FROM alumnas')
result=my_cursor.fetchall()
df_alumnas=pd.DataFrame(result, columns=['ID', 'Nombre', 'Apellidos', 'Ciudad', 'Teléfono'])
cnx.close()

In [7]:
df_alumnas

   ID   Nombre          Apellidos      Ciudad   Teléfono
0   1    María     Martínez López        Vigo  666111222
1   2    Lucía  Rodríguez Estévez    A Coruña  666222333
2   3    Carla     López Castelao  Pontevedra  666333444
3   4    Kasia      Torres Arriba     Vilaboa  666444555
4   5    Joyce    Tapias González   Camariñas  666555666
5   6     Kate            Winslet        Bath  666666777
6   7    Alice     Gould Almenara      Madrid  666777888
7   8     Lola    Bernárdez Balit   Corrubedo  666888999
8   9  Ivanira       Silva Montes        Vigo  666999111
9  10   Joanna   Blanchet Hataway        Lugo  666123456

In [8]:
#extrayendo la tabla con los encabezados directamente
cnx=mysql.connector.connect(user='root', password='AlumnaAdalab', host='127.0.0.1', database='alumnas_promo_h')
my_cursor=cnx.cursor()
sentencia='SELECT * FROM alumnas'
df_alumnas2=pd.read_sql_query(sentencia, cnx)
cnx.close()

C:\Users\marti\AppData\Local\Temp\ipykernel_15280\186262597.py:5: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_alumnas2=pd.read_sql_query(sentencia, cnx)

In [9]:
df_alumnas2

   id_alumna   nombre          apellidos      ciudad   telefono
0          1    María     Martínez López        Vigo  666111222
1          2    Lucía  Rodríguez Estévez    A Coruña  666222333
2          3    Carla     López Castelao  Pontevedra  666333444
3          4    Kasia      Torres Arriba     Vilaboa  666444555
4          5    Joyce    Tapias González   Camariñas  666555666
5          6     Kate            Winslet        Bath  666666777
6          7    Alice     Gould Almenara      Madrid  666777888
7          8     Lola    Bernárdez Balit   Corrubedo  666888999
8          9  Ivanira       Silva Montes        Vigo  666999111
9         10   Joanna   Blanchet Hataway        Lugo  666123456

6. Muestra los 3 primeros y tres últimos registros del Dataframe.

In [10]:
df_alumnas2.head(3)

   id_alumna nombre          apellidos      ciudad   telefono
0          1  María     Martínez López        Vigo  666111222
1          2  Lucía  Rodríguez Estévez    A Coruña  666222333
2          3  Carla     López Castelao  Pontevedra  666333444

In [11]:
df_alumnas2.tail(3)

   id_alumna   nombre         apellidos     ciudad   telefono
7          8     Lola   Bernárdez Balit  Corrubedo  666888999
8          9  Ivanira      Silva Montes       Vigo  666999111
9         10   Joanna  Blanchet Hataway       Lugo  666123456

7. ¿Hay registros duplicados?

In [12]:
df_alumnas2.duplicated().sum()

0

### Bonus:

8. Haz una consulta para extraer las diferentes ciudades en las que hay alumnas.

In [13]:
cnx=mysql.connector.connect(user='root', password='AlumnaAdalab', host='127.0.0.1', database='alumnas_promo_h')
my_cursor=cnx.cursor()
query='SELECT DISTINCT ciudad FROM alumnas'
#convierto el resultado de la query en un DataFrame
df_ciudades = pd.read_sql_query(query, cnx)
cnx.close()
df_ciudades

C:\Users\marti\AppData\Local\Temp\ipykernel_15280\3796093641.py:5: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_ciudades = pd.read_sql_query(query, cnx)

       ciudad
0        Vigo
1    A Coruña
2  Pontevedra
3     Vilaboa
4   Camariñas
5        Bath
6      Madrid
7   Corrubedo
8        Lugo

9. Crea al menos dos Dataframes con la información de las alumnas de dos ciudades diferentes (usando dos queries).

In [14]:
cnx=mysql.connector.connect(user='root', password='AlumnaAdalab', host='127.0.0.1', database='alumnas_promo_h')
my_cursor=cnx.cursor()
query='SELECT * FROM alumnas WHERE ciudad = "Vigo"'
df_vigo=pd.read_sql_query(query, cnx)
cnx.close()
df_vigo

C:\Users\marti\AppData\Local\Temp\ipykernel_15280\1516150356.py:4: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_vigo=pd.read_sql_query(query, cnx)

   id_alumna   nombre       apellidos ciudad   telefono
0          1    María  Martínez López   Vigo  666111222
1          9  Ivanira    Silva Montes   Vigo  666999111

In [15]:
cnx=mysql.connector.connect(user='root', password='AlumnaAdalab', host='127.0.0.1', database='alumnas_promo_h')
my_cursor=cnx.cursor()
query='SELECT nombre, apellidos, ciudad FROM alumnas WHERE ciudad = "Bath"'
df_bath=pd.read_sql_query(query, cnx)
cnx.close()
df_bath

C:\Users\marti\AppData\Local\Temp\ipykernel_15280\3395539371.py:4: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_bath=pd.read_sql_query(query, cnx)

  nombre apellidos ciudad
0   Kate   Winslet   Bath